---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopyLocked
source: html/8effe552-bbcc-556e-9548-8649d2d5e53c.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopyLocked Property

Can't copy pinned element.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCopyLocked { get; }
```